# Bailey Sweis
## week 14: 4/21/22
## python - dataframe processing data

In [11]:
import numpy as np
from pandas import DataFrame

In [12]:
import pandas as pd

In [13]:
#thresh
## keep only the rows having 2 or more valid data
df.dropna(thresh=3)

TypeError: dropna() missing 1 required positional argument: 'self'

In [14]:
df.fillna(0)

TypeError: super(type, obj): obj must be an instance or subtype of type

In [17]:
df = DataFrame({1,0,7,4})

In [18]:
df

   0
0  0
1  2
2  3
3  4

In [19]:
df = DataFrame({'Qu1': [1,3,4,3,4],
               'Qu2': [2,3,1,2,3],
               'Qu3': [1,5,2,4,4]}, index = ['a','b','c','d','e'])

In [20]:
df

   Qu1  Qu2  Qu3
a    1    2    1
b    3    3    5
c    4    1    2
d    3    2    4
e    4    3    4

In [21]:
df['Qu1']

a    1
b    3
c    4
d    3
e    4
Name: Qu1, dtype: int64

In [23]:
df['Qu1'].value_counts()

4    2
3    2
1    1
Name: Qu1, dtype: int64

In [25]:
# create a dataframe with all the data fields counts
nc = df.apply(pd.value_counts)
nc

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [26]:
nc.fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [27]:
nc.fillna(0).astype(int)

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

In [28]:
nc = df.apply(pd.value_counts).fillna(0).astype(int)

In [29]:
nc

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

In [30]:
nc.index.name='values'

In [31]:
nc

        Qu1  Qu2  Qu3
values
1         1    1    1
2         0    2    1
3         2    2    0
4         2    0    2
5         0    0    1

In [32]:
df

   Qu1  Qu2  Qu3
a    1    2    1
b    3    3    5
c    4    1    2
d    3    2    4
e    4    3    4